/*
 ============================================================================
 Name        : RFtermCodePages.h
 Author      : Konstantin Baranovskiy
 Copyright   : GPLv3
 Description : Characters from range 128-255 of different code pages.
 ============================================================================
 */

#ifndef RFTERMCODEPAGES_H
#define RFTERMCODEPAGES_H

const TUint KCodePageSize = 256;

//	 0123456789ABCDEF
//	"                " //8
//	"                " //9
//	" ¡¢£¤¥¦§¨©ª«¬­®¯" //A
//	"°±²³´µ¶·¸¹º»¼½¾¿" //B
//	"ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏ" //C
//	"ÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß" //D
//	"àáâãäåæçèéêëìíîï" //E
//	"ðñòóôõö÷øùúûüýþÿ" //F
_LIT(KCodePageLatin1,
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\u00a0\u00a1\u00a2\u00a3\u00a4\u00a5\u00a6\u00a7\u00a8\u00a9\u00aa\u00ab\u00ac\u00ad\u00ae\u00af"
"\u00b0\u00b1\u00b2\u00b3\u00b4\u00b5\u00b6\u00b7\u00b8\u00b9\u00ba\u00bb\u00bc\u00bd\u00be\u00bf"
"\u00c0\u00c1\u00c2\u00c3\u00c4\u00c5\u00c6\u00c7\u00c8\u00c9\u00ca\u00cb\u00cc\u00cd\u00ce\u00cf"
"\u00d0\u00d1\u00d2\u00d3\u00d4\u00d5\u00d6\u00d7\u00d8\u00d9\u00da\u00db\u00dc\u00dd\u00de\u00df"
"\u00e0\u00e1\u00e2\u00e3\u00e4\u00e5\u00e6\u00e7\u00e8\u00e9\u00ea\u00eb\u00ec\u00ed\u00ee\u00ef"
"\u00f0\u00f1\u00f2\u00f3\u00f4\u00f5\u00f6\u00f7\u00f8\u00f9\u00fa\u00fb\u00fc\u00fd\u00fe\u00ff"
);

//	 0123456789ABCDEF
//	"                " //8
//	"                " //9
//	" Ą˘Ł¤ĽŚ§¨ŠŞŤŹ­ŽŻ" //A
//	"°ą˛ł´ľśˇ¸šşťź˝žż" //B
//	"ŔÁÂĂÄĹĆÇČÉĘËĚÍÎĎ" //C
//	"ĐŃŇÓÔŐÖ×ŘŮÚŰÜÝŢß" //D
//	"ŕáâăäĺćçčéęëěíîď" //E
//	"đńňóôőö÷řůúűüýţ˙" //F
_LIT(KCodePageLatin2,
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\u00a0\u0104\u02d8\u0141\u00a4\u013d\u015a\u00a7\u00a8\u0160\u015e\u0164\u0179\u00ad\u017d\u017b"
"\u00b0\u0105\u02db\u0142\u00b4\u013e\u015b\u02c7\u00b8\u0161\u015f\u0165\u017a\u02dd\u017e\u017c"
"\u0154\u00c1\u00c2\u0102\u00c4\u0139\u0106\u00c7\u010c\u00c9\u0118\u00cb\u011a\u00cd\u00ce\u010e"
"\u0110\u0143\u0147\u00d3\u00d4\u0150\u00d6\u00d7\u0158\u016e\u00da\u0170\u00dc\u00dd\u0162\u00df"
"\u0155\u00e1\u00e2\u0103\u00e4\u013a\u0107\u00e7\u010d\u00e9\u0119\u00eb\u011b\u00ed\u00ee\u010f"
"\u0111\u0144\u0148\u00f3\u00f4\u0151\u00f6\u00f7\u0159\u016f\u00fa\u0171\u00fc\u00fd\u0163\u02d9"
);

//	 0123456789ABCDEF
//	"                " //8
//	"                " //9
//	" Ħ˘£¤¥Ĥ§¨İŞĞĴ­®Ż" //A
//	"°ħ²³´µĥ·¸ışğĵ½¾ż" //B
//	"ÀÁÂ ÄĊĈÇÈÉÊËÌÍÎÏ" //C
//	" ÑÒÓÔĠÖ×ĜÙÚÛÜŬŜß" //D
//	"àáâ äċĉçèéêëìíîï" //E
//	" ñòóôġö÷ĝùúûüŭŝ˙" //F
_LIT(KCodePageLatin3,
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\x0020\u0126\u02d8\u00a3\u00a4\u00a5\u0124\u00a7\u00a8\u0130\u015e\u011e\u0134\u00ad\u00ae\u017b"
"\u00b0\u0127\u00b2\u00b3\u00b4\u00b5\u0125\u00b7\u00b8\u0131\u015f\u011f\u0135\u00bd\u00be\u017c"
"\u00c0\u00c1\u00c2\x0020\u00c4\u010a\u0108\u00c7\u00c8\u00c9\u00ca\u00cb\u00cc\u00cd\u00ce\u00cf"
"\x0020\u00d1\u00d2\u00d3\u00d4\u0120\u00d6\u00d7\u011c\u00d9\u00da\u00db\u00dc\u016c\u015c\u00df"
"\u00e0\u00e1\u00e2\x0020\u00e4\u010b\u0109\u00e7\u00e8\u00e9\u00ea\u00eb\u00ec\u00ed\u00ee\u00ef"
"\x0020\u00f1\u00f2\u00f3\u00f4\u0121\u00f6\u00f7\u011d\u00f9\u00fa\u00fb\u00fc\u016d\u015d\u02d9"
);

//	 0123456789ABCDEF
//	"                " //8
//	"                " //9
//	" ĄĸŖ¤ĨĻ§¨ŠĒĢŦ­Ž¯" //A
//	"°ą˛ŗ´ĩļˇ¸šēģŧŊžŋ" //B
//	"ĀÁÂÃÄÅÆĮČÉĘËĖÍÎĪ" //C
//	"ĐŅŌĶÔÕÖ×ØŲÚÛÜŨŪß" //D
//	"āáâãäåæįčéęëėíîī" //E
//	"đņōķôõö÷øųúûüũū˙" //F
_LIT(KCodePageLatin4,
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\u00a0\u0104\u0138\u0156\u00a4\u0128\u013b\u00a7\u00a8\u0160\u0112\u0122\u0166\u00ad\u017d\u00af"
"\u00b0\u0105\u02db\u0157\u00b4\u0129\u013c\u02c7\u00b8\u0161\u0113\u0123\u0167\u014a\u017e\u014b"
"\u0100\u00c1\u00c2\u00c3\u00c4\u00c5\u00c6\u012e\u010c\u00c9\u0118\u00cb\u0116\u00cd\u00ce\u012a"
"\u0110\u0145\u014c\u0136\u00d4\u00d5\u00d6\u00d7\u00d8\u0172\u00da\u00db\u00dc\u0168\u016a\u00df"
"\u0101\u00e1\u00e2\u00e3\u00e4\u00e5\u00e6\u012f\u010d\u00e9\u0119\u00eb\u0117\u00ed\u00ee\u012b"
"\u0111\u0146\u014d\u0137\u00f4\u00f5\u00f6\u00f7\u00f8\u0173\u00fa\u00fb\u00fc\u0169\u016b\u02d9"
);

//	 0123456789ABCDEF
//	"                " //8
//	"                " //9
//	" ЁЂЃЄЅІЇЈЉЊЋЌ ЎЏ" //A
//	"АБВГДЕЖЗИЙКЛМНОП" //B
//	"РСТУФХЦЧШЩЪЫЬЭЮЯ" //C
//	"абвгдежзийклмноп" //D
//	"рстуфхцчшщъыьэюя" //E
//	"№ёђѓєѕіїјљњћќ§ўџ" //F
_LIT(KCodePageLatinCyrillic,
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\u00a0\u0401\u0402\u0403\u0404\u0405\u0406\u0407\u0408\u0409\u040a\u040b\u040c\x0020\u040e\u040f"
"\u0410\u0411\u0412\u0413\u0414\u0415\u0416\u0417\u0418\u0419\u041a\u041b\u041c\u041d\u041e\u041f"
"\u0420\u0421\u0422\u0423\u0424\u0425\u0426\u0427\u0428\u0429\u042a\u042b\u042c\u042d\u042e\u042f"
"\u0430\u0431\u0432\u0433\u0434\u0435\u0436\u0437\u0438\u0439\u043a\u043b\u043c\u043d\u043e\u043f"
"\u0440\u0441\u0442\u0443\u0444\u0445\u0446\u0447\u0448\u0449\u044a\u044b\u044c\u044d\u044e\u044f"
"\u2116\u0451\u0452\u0453\u0454\u0455\u0456\u0457\u0458\u0459\u045a\u045b\u045c\u00a7\u045e\u045f"
);

//	 0123456789ABCDEF
//	"ЂЃ‚ѓ„…†‡€‰Љ‹ЊЌЋЏ" //8
//	"ђ‘’“”•–—™ љ›њќћџ" //9
//	" ЎўЈ¤Ґ¦§Ё©Є«¬­®Ї" //A
//	"°±Ііґµ¶·ё№є»јЅѕї" //B
//	"АБВГДЕЖЗИЙКЛМНОП" //C
//	"РСТУФХЦЧШЩЪЫЬЭЮЯ" //D
//	"абвгдежзийклмноп" //E
//	"рстуфхцчшщъыьэюя" //F
_LIT(KCodePage1251,
"\u0402\u0403\u201a\u0453\u201e\u2026\u2020\u2021\u20ac\u2030\u0409\u2039\u040a\u040c\u040b\u040f"
"\u0452\u2018\u2019\u201c\u201d\u2022\u2013\u2014\u2122\x0020\u0459\u203a\u045a\u045c\u045b\u045f"
"\u00a0\u040e\u045e\u0408\u00a4\u0490\u00a6\u00a7\u0401\u00a9\u0404\u00ab\u00ac\u00ad\u00ae\u0407"
"\u00b0\u00b1\u0406\u0456\u0491\u00b5\u00b6\u00b7\u0451\u2116\u0454\u00bb\u0458\u0405\u0455\u0457"
"\u0410\u0411\u0412\u0413\u0414\u0415\u0416\u0417\u0418\u0419\u041a\u041b\u041c\u041d\u041e\u041f"
"\u0420\u0421\u0422\u0423\u0424\u0425\u0426\u0427\u0428\u0429\u042a\u042b\u042c\u042d\u042e\u042f"
"\u0430\u0431\u0432\u0433\u0434\u0435\u0436\u0437\u0438\u0439\u043a\u043b\u043c\u043d\u043e\u043f"
"\u0440\u0441\u0442\u0443\u0444\u0445\u0446\u0447\u0448\u0449\u044a\u044b\u044c\u044d\u044e\u044f"
);

//	 0123456789ABCDEF
//	"€ ‚ƒ„…†‡ˆ‰Š‹Œ Ž " //8
//	" ‘’“”•–—˜™š›œ žŸ" //9
//	" ¡¢£¤¥¦§¨©ª«¬­®¯" //A
//	"°±²³´µ¶·¸¹º»¼½¾¿" //B
//	"ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏ" //C
//	"ÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß" //D
//	"àáâãäåæçèéêëìíîï" //E
//	"ðñòóôõö÷øùúûüýþÿ" //F
_LIT(KCodePage1252,
"\u20ac\x0020\u201a\u0192\u201e\u2026\u2020\u2021\u02c6\u2030\u0160\u2039\u0152\x0020\u017d\x0020"
"\x0020\u2018\u2019\u201c\u201d\u2022\u2013\u2014\u02dc\u2122\u0161\u203a\u0153\x0020\u017e\u0178"
"\u00a0\u00a1\u00a2\u00a3\u00a4\u00a5\u00a6\u00a7\u00a8\u00a9\u00aa\u00ab\u00ac\u00ad\u00ae\u00af"
"\u00b0\u00b1\u00b2\u00b3\u00b4\u00b5\u00b6\u00b7\u00b8\u00b9\u00ba\u00bb\u00bc\u00bd\u00be\u00bf"
"\u00c0\u00c1\u00c2\u00c3\u00c4\u00c5\u00c6\u00c7\u00c8\u00c9\u00ca\u00cb\u00cc\u00cd\u00ce\u00cf"
"\u00d0\u00d1\u00d2\u00d3\u00d4\u00d5\u00d6\u00d7\u00d8\u00d9\u00da\u00db\u00dc\u00dd\u00de\u00df"
"\u00e0\u00e1\u00e2\u00e3\u00e4\u00e5\u00e6\u00e7\u00e8\u00e9\u00ea\u00eb\u00ec\u00ed\u00ee\u00ef"
"\u00f0\u00f1\u00f2\u00f3\u00f4\u00f5\u00f6\u00f7\u00f8\u00f9\u00fa\u00fb\u00fc\u00fd\u00fe\u00ff"
);

//	 0123456789ABCDEF
//	"                " //8
//	"                " //9
//	"                " //A
//	"                " //B
//	"юабцдефгхийклмно" //C
//	"пярстужвьызшэщчъ" //D
//	"ЮАБЦДЕФГХИЙКЛМНО" //E
//	"ПЯРСТУЖВЬЫЗШЭЩЧ " //F
_LIT(KCodePageKOI8,
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020\x0020"
"\u044e\u0430\u0431\u0446\u0434\u0435\u0444\u0433\u0445\u0438\u0439\u043a\u043b\u043c\u043d\u043e"
"\u043f\u044f\u0440\u0441\u0442\u0443\u0436\u0432\u044c\u044b\u0437\u0448\u044d\u0449\u0447\u044a"
"\u042e\u0410\u0411\u0426\u0414\u0415\u0424\u0413\u0425\u0418\u0419\u041a\u041b\u041c\u041d\u041e"
"\u041f\u042f\u0420\u0421\u0422\u0423\u0416\u0412\u042c\u042b\u0417\u0428\u042d\u0429\u0427\x0020"
);

#endif /* RFTERMCODEPAGES_H */
